setwd("Classification/")

source("Function.R")
preddata <- c("一汽的资本困局与救赎

              这个顶着第一汽车集团之名的车企，在很多方面已经不再排名第一。截至2015年3月19日，一汽集团旗下5家上市公司的市值合计为677亿元，尚不及上汽集团的四分之一。一汽集团内部腐败始终被视为阻碍整体上市的大屏障，高层接受调查，反腐或催化整体上市。嗅觉灵敏的机构已经提前出逃。
              
              理财周报记者 郭建鹏 戴建敏/北京 深圳报道
              
              两会闭幕后，在金台饭店，一汽集团董事长徐建一被带走。
              
              随后，中纪委官网上发布“中国第一汽车集团公司董事长、党委书记徐建一涉嫌严重违纪违法，目前正接受组织调查”的官方消息。
              
              实际上，这不是针对一汽集团的首次反腐行动，公开的媒体报道显示，在徐建一的事件的前后，一汽集团内部，一系列反腐行动仍在进行。
              
              距离2016年一汽集团整体上市的日子越发逼近，此时，一汽集团高管震荡，而旗下上市公司也是业绩尴尬，下一步，一汽集团将驶向哪里？
              
              采访期间，理财周报记者试图联系一汽夏利、一汽轿车两家上市公司的相关负责人，但截至发稿依然没有得到回复。而一汽集团内部一位相关人士表示，对于此事个人不便进行评价，公司层面，目前可以参考的观点，仅限于“一汽集团公司相继召开党委常委会和领导干部会议”的相关内容。
              
              徐建一之后，谁将成为接棒者？
              
              而资本市场上嗅觉灵敏的机构已经提前迅速作出反应。理财周报记者发现，早在此次徐建一接受调查前，一汽集团旗下一些上市公司中，公募机构已经纷纷出逃。
              
              5家上市公司市值仅上汽1/4
              
              3月15日18时许，中央纪委监察部网站发布消息：中国第一汽车集团公司董事长、党委书记徐建一涉嫌严重违纪违法，目前正接受组织调查。
              
              16日，一汽集团旗下上市公司股价表现不一，其中一汽轿车早盘低开后一度重挫逾5%，收盘报18.90元，跌1.92%。而其余四家公司一汽夏利、一汽富维、富奥股份、启明信息开盘也出现集体下跌的趋势，但盘中受大盘影响翻红。最终一汽夏利平盘报收于7.58元；一汽富维以1.8%的涨幅报收33.3元；富奥股份以2.56%的涨幅报收9.23元；而启明信息则报收14.97元，大涨9.83%。
              
              随后几日，三家零部件上市公司一汽富维、富奥股份、启明信息股价继续走强，相继创出近年新高。而两家整车上市公司一汽轿车、一汽夏利已分别于3月2日和3月13日创出新高，16日后，一汽轿车、一汽夏利股价持续小幅上下波动。
              
              不过相同的是，5家上市公司的成交量在16日后均出现明显的增长。Wind数据显示，一汽轿车3月16日、17日、18日的成交量分别达到65.55万手、56.16万手、34.18万手，而一汽桥车15日的成交量仅为8.5万手。一汽夏利16日的成交量也攀升至23.64万手，其之前一个交易日成交量仅为14.41万手。
              
              据了解，一汽轿车为一汽集团发展自主品牌乘用车的骨干企业，现有红旗、奔腾、欧朗和Mazda等乘用车产品系列。
              
              一汽轿车前期主要是自主研发和引进国外先进技术生产红旗系列轿车，如红旗98、红旗明仕、红旗18等。2003年公司引进马自达6轿车产品，当年即创造了产销5万辆整车的历史记录。2006年公司推出吸收使用马自达6技术的奔腾B70，进军经济型轿车生产领域，自此公司自主品牌业务快速发展，目前自主品牌产销规模已达总销量的50%以上。
              
              不过，中银国际证券表示，由于一汽轿车产品盈利能力较差，且开支较大，导致利润率较低，利润规模较小，占整个一汽集团利润仅有百分之几。
              
              一汽轿车2014年业绩预告显示，预计2014年净利润为5000万元至2.5亿元，同比下降75.18%至95.04%。公司解释，为提升产品市场占有率和品牌竞争力，加大了宣传力度，费用相应增加；加之部分产品销售结构发生变化，导致公司业绩较上年出现大幅下降。
              
              而一汽夏利为一汽集团控股的经济型轿车制造企业，主要生产“夏利”、“威志”系列轿车，2002年受让天汽集团持有的天津夏利50.98%的股权，天津夏利自此纳入一汽集团旗下。
              
              一位汽车业内人士介绍，夏利在被一汽集团收购后没有能够获得集团更多的资源共享。按照此前一汽集团的规划，天津夏利只能在A0级轿车“施展”，比如此前推向市场的夏利系和威志系轿车，都未能突破这个范畴。这样的战略，使得夏利在产品发展上受局限颇大，随着中国汽车市场进入升级换代的时期，一汽夏利一下子就走到了濒临破产的边缘。
              
              由于产品老旧、无有竞争力的新产品投放等问题，一汽夏利年产销规模逐步下降，2014年产销规模仅有7.2万辆，尚不足部分汽车企业的单月销量。
              
              而这也导致一汽夏利亏损额度进一步扩大，公司业绩预告预计2014年亏损15.5亿元至17.5亿元，而在前一年公司已亏损4.8亿元，一汽夏利在年报发布会将难逃“ST”处理。
              
              一汽夏利表示，业绩下降的主要原因为公司在国内汽车市场消费升级、部分城市限购、经济型轿车市场份额持续快速下降等因素的影响下，公司产品结构升级调整的步伐未能适应市场快速变化的要求。
              
              同时，公司参股的天津一汽丰田汽车有限公司因当前市场形势和产品结构的变化，以及本身正在进行产品结构调整等原因，年内其向本公司贡献的投资收益同比也有较大幅度的下降。
              
              一汽富维、启明信息、奥创股份则为汽车零配件厂商。其中一汽富维主要产品为车轮、内外饰、保险杠等，奥创股份的主要产品为散热器总成、减震器总成等，启明信息则主要生产汽车电子产品和管理软件。然而这三件零配件公司业绩近年来也未有明显增长。
              
              启明信息业绩快报显示，公司2014年实现营业总收入13.88亿元，同比增长3.52%，归属于上市公司股东的净利润为768.79万元，同比增长1.00%，各项主要财务指标基本与上一年度持平。
              
              奥创股份2013年前三季度实现营业收入38.14亿元，同比仅增长0.23%，实现归属于上市公司股东的净利润为4.76亿元，同比增长17.17%。
              
              一汽富维则在2014年实现营业总收入112.73亿元，同比增长19.01%，归属于上市公司股东的净利润为5.53亿元，同比增长50.95%。公司介绍，成都及佛山基地开始正式运营，同时公司内部加强成本费用控制，使公司收入及利润大幅增加。
              
              截至2015年3月19日，一汽集团旗下5家上市公司的市值合计为677亿元，尚不及上汽集团2724亿元市值的四分之一。
              
              反腐进行时
              
              一汽集团内部反腐工作推进已久。
              
              2014年7月29日，中央第十三巡视组对一汽开展专项巡视后，2014年9月一汽集团原副总经理安德武、一汽-大众汽车有限公司原副总经理兼销售公司总经理李武、一汽-大众奥迪销售事业部副总经理周纯被调查。
              
              今年1月30日，中央纪委监察部官网通报了一汽集团关于专项巡视整改的情况，称一汽集团就党风廉政建设责任落实不够到位，执行“三重一大”制度不力，顶风违纪和整改工作不力，以及汽车销售、资源配置领域腐败多发。
              
              而在中央纪委通报一汽集团关于专项巡视整改的情况后，徐建一曾表示，巡视组反馈的情况完全符合一汽实际(状况)，并提出了五项整改方案，准备列出“问题清单”，建立整改台账，明确整改责任，清晰完成时限。与此同时，一汽集团公司8个职能部门参与组建的整改专项工作组，针对26项问题进行全面整顿。
              
              然而，徐建一提出的整改方案尚未推行，其本人即遭纪委调查。
              
              华融证券表示，对一汽集团董事长的调查，表明中央对公司的反腐进一步深化，有助于解决人事、腐败问题，利好整体上市。同时，人事、腐败问题的解决一定程度上促进合资公司股权利益问题的解决，加快整体上市进程。
              
              实际上，早在2013年4月时，一汽集团旗下一汽轿车、一汽夏利、启明信息便相继公告，徐建一因工作需要辞去在各上市公司担任的董事和董事长的职务，辞职后不在上市公司担任任何职务。彼时，一汽集团表示，徐建一辞去职务，是一汽按照现代企业制度规范运作的一种正常的职务安排，是加快决策层和执行层分开的举措。
              
              而许宪平在随后的董事会选举中接任徐建一，成为一汽轿车、一汽夏利、启明信息的董事长和董事职务。
              
              华融证券表示，前期一汽集团已对现有管理层分工进行调整，许宪平接替徐建一担任下属多家上市公司董事和董事长，本次反腐或会加速公司管理层的调整，待集团管理层的调整到位，预计一汽集团整体上市的进程有望顺利推进。
              
              而就在中央纪委监察部网站发布徐建一接受调查的第二日，一汽集团公司相继召开党委常委会和领导干部会议，认真学习传达中央纪委、中央组织部、国务院国资委[微博]党委和吉林省委的部署要求。而一汽集团公司总经理、党委副书记许宪平为会议主持。
              
              针对集团公司董事长徐建一因涉嫌严重违纪违法被调查一事，一汽集团公司表示坚决拥护中央决定，将积极配合好专案组调查。
              
              一汽集团官网显示，许宪平现担任中国第一汽车集团公司董事、总经理、党委副书记，历任集团公司总经理助理兼一汽丰田项目筹备组副组长，集团公司总经理助理兼天津一汽夏利公司总经理，集团公司总经理助理兼一汽解放公司总经理，集团公司总经理助理，集团公司副总经理，集团公司总经理、董事、党委常委等职。
              
              整体上市大考
              
              早在2010年，在国内前五大汽车集团的市值排名榜中，一汽集团就成为了垫底者。
              
              根据公开资料显示，一汽集团市值不足500亿元，彼时就不及上汽集团的四分之一。当时，上汽集团市值达2170余亿元。另一方面，2010年时，一汽集团资产为1725亿元，总负债为1025亿元，一汽集团的资产负债率约60%，所以，如果一汽集团能够实现整体上市，将会获得更充裕的资金，对于一汽集团十分重要。
              
              一汽集团的整体上市之路，在2011年开启。
              
              公开资料显示，为完成整体上市，一汽集团2011年成立了整体上市平台一汽股份，此后一汽股份成为一汽轿车、一汽夏利的直接控股股东。一汽股份则承诺：为解决同业竞争，将在五年内(2016年6月28日为最后期限)通过资产重组或其他方式整合所属的轿车整车生产业务，以解决与一汽轿车、一汽夏利的同业竞争问题；同时，对一汽夏利，一汽股份还承诺2015年4月5日前规范和减少与其的关联交易。
              
              根据国务院国资委批复的整体重组改制方案，中国一汽将整车及关键零部件业务及资产、人员全部投入一汽股份。一汽股份以整车汽车制造、销售、服务及汽车技术研究、开发及服务为主业。
              
              2014年一汽股份销售整车308.6万辆，位居行业第三位，其中乘用车284.9万辆，商用车23.7万辆。乘用车销量主要来自两家合资公司一汽大众和一汽丰田，商用车销量主要来自一汽解放的中重卡。而上市公司一汽轿车、一汽夏利仅占整车销量总量的11%。
              
              根据中银国际证券测算，2014年一汽股份在销量、收入、净利润、净资产等方面与上汽集团基本相当，其中一汽股份归属于母公司的净利润约为259.5 亿元，略低于上汽集团。
              
              中银国际证券同时表示，一汽股份未来成长性更好，预计一汽集团整体上市后，市值有望达到300亿元左右。
              
              然而，一汽股份的整体上市计划却一直未能成行。华融证券表示，合资股权利益问题和人事、腐败问题是阻碍一汽整体上市的两个主要因素。对一汽而言，一汽大众和一汽丰田是其主要的利润来源，将两家合资公司中的中方资产注入一汽股份对其整体上市至关重要。而一直以来，一汽与大众、丰田之间存在股权利益问题，阻碍了整体上市进程的推进。此外，公司原有人事、腐败问题不解决，其整体上市将难以推进。
              
              华南一位汽车行业分析师表示，“此次一汽集团董事长徐建一被调查，最大‘老虎’挖出，表明一汽集团反腐工作取得成功，基本扫清腐败问题对整体上市的影响。”
              
              伴随一汽集团整体上市进程，徐建一也在实践一汽集团的自主品牌发展规划。在2010年的北京车展上，徐建一就曾提出了自主品牌发展规划，主要内容为，中国一汽下辖“中国一汽”和“红旗”两个母品牌，其中中国一汽下辖“解放”、“奔腾”、“夏利”、“佳宝”四个产品品牌。
              
              后来被业内人士诟病的是，一汽集团在红旗品牌的大力投入适得其反，当时针对公务车市场重点推进的红旗品牌，后由于国家逐步取消了政府公务车的采购，从而接近失败。
              
              徐建一时代，一汽集团另一大失误，便是上述提及的一汽夏利。
              
              机构提前出逃
              
              目前，一汽集团旗下5家上市公司中，处境最为尴尬的是面临“ST”的一汽夏利，而公募机构早就纷纷“逃离”。
              
              2014年二季度末，有31只公募基金产品持有一汽夏利，截至当年三季度末时，只有11只基金产品持有一汽夏利；而截至2014年四季度末，仅剩下两只基金产品持有一汽夏利。
              
              具体来看，尽管去年二季度末时多达31只基金产品持有一汽夏利，但持股市值仅有1.06亿元，而四季度末虽然有两只产品持有该股，但持股总市值达到了1.11亿元。
              
              随着一汽夏利“ST”命运的一步步逼近，最后仍旧持有一汽夏利的两只基金产品分别为交银成长股票和交银新成长股票，均来自交银施罗德基金[微博]公司，而管理这两只产品的基金经理，都是管华雨。
              
              公开资料显示，管华雨目前担任交银施罗德权益投资总监，是公司内资历最老的基金经理，基金经理从业时间超过7年，其于2010年加入交银基金，历任权益部总经理助理、权益部副总经理，现任权益部总经理。
              
              在上述两只基金的四季报中，一汽夏利都是这两只产品的第十大重仓股。其中，交银成长持仓一汽夏利占比为2.25%，交银新成长持仓一汽夏利占比为3.33%。今年来，交银新成长和交银成长这两只基金产品的业绩分别为34.3%和31.4%。
              
              对此，北京地区一位基金人士表示，机构在去年末时仍坚守一汽夏利，还是出于对一汽集团整体上市的期待，尽管一汽夏利面临“ST”，但是一汽集团曾经承诺2016年实现整体上市，而届时一汽夏利的命运也将改变，“机构看重的是一汽整体上市后解决的同业竞争问题，此外整体上市也包含着国企改革概念，这是今年的市场热点。”
              
              另外值得关注的是，交银施罗德基金是交通银行(6.48, 0.04, 0.62%)的子公司，而一汽集团也是交通银行的股东，股东层面的关系，或许也对交银施罗德基金选择一汽夏利有些许影响。
              
              公开资料显示，2014年10月时，交银施罗德的任相栋、王少成、王崇、张鸿羽等人就曾前往一汽夏利调研。
              
              而根据公开的调研记录来看，近一年多来机构前往一汽夏利调研时，最关心的仍是一汽集团整体上市、同业竞争等问题，但是始终没有得到公司方面切实的回答。
              
              “其实机构人士调研就集中在整体上市，可难以得到有干货的答案，集团、公司层面也没见到实际的推动。”一位私募人士说，一汽集团内部腐败始终就被视为阻碍整体上市的大屏障，“反腐的深入开展，会清除障碍、推进一汽整体上市。”
              
              与一汽夏利相同，一汽集团旗下另一家整车上市公司一汽轿车，去年也遭遇了机构的出走。
              
              2014年二季度末时，尚有104只基金产品持有一汽轿车，而截至四季度末，仅有9只产品持有该股。据一位机构人士介绍，二季度时一汽轿车被公募大量持有，主要是当时一汽轿车推出新车型，公募机构看好了这个机会，但随后的三季报业绩不及预期，令人失望。
              
              2014年四季度末，富国天益价值股票、华夏复兴股票分别持有一汽轿车的市值为2.16亿元和1.42亿元，是9只基金产品中，持有一汽轿车股份最多的基金产品。
              
              值得注意的是，去年底时，曾有18家机构、20位机构人士前往一汽轿车调研，其中不乏嘉实、建信、广发等公募行业的大公司。一位机构人士透露，当天的调研中，诸多机构仍关心一汽集团整体上市的问题，但一汽轿车与一汽夏利的情况雷同，没有给出具有实际内容的回答。
              
              “其实一汽集团整体上市不仅机构关注，一汽旗下的上市公司更加期待，但一汽集团内部庞杂，谁也说不清或者不敢说整体上市的确切情况。”这位机构人士说。
              
              国企改革预期
              
              不难看出，对于此次一汽集团反腐事件，多数业内人士对一汽集团的后续表现持乐观态度。
              
              上述北京地区基金人士就表示，一汽集团至今仍未实现整体上市，在现有大型汽车集团中，非常具有国企改革的韵味。目前一汽集团上市主要有两种可行方案，第一种是，借壳一汽轿车吸收合并一汽夏利；第二种可能是一汽独立上市成功后，再吸收合并旗下上市公司，至少可以看到，面临“ST”的一汽夏利即将出现转机。
              
              事实上，随着北汽集团在香港的上市，“四大四小”的汽车集团结构中，仅有一汽集团和奇瑞汽车尚未整体上市或上市。考虑到国企混合所有制改革和一汽集团同业竞争问题，以及各自的盈利情况，业内普遍认为，一汽集团整体上市将是汽车行业国企改革的首要事件。
              
              此外，一汽集团早就具备国企改革的色彩。早在去年7月份时，一汽集团持股的交通银行，就率先推进了国企混改方案，截至2014年三季度末，一汽集团持有交通银行0.89%的股份，是其第八大股东。
              
              彼时，接受理财周报记者采访时，一汽集团一位负责人就表示，今后随着一汽集团的整体上市，集团方面也将受益于交通银行正在推进的国企混改，“这样，一汽集团无疑在金融、国企改革方面都具有了很明显的标识。”
              
              对于一汽集团即将面临的国企改革，华泰证券(27.24, 2.38, 9.57%)分析师姚宏光认为，国企改革精彩纷呈，一汽作为最重要的部分，不容缺席。
              
              在他看来，自十八大以来，央企和行业层面的案例不断丰富，使得国企改革变得有血有肉，一汽集团在未来一年半时间内推行国企改革的概率比以往任何时候都大。
              
              在分析原因时，除了央企改革速度超乎市场想象外，汽车行业普遍推行国企改革、主动谋变，更为值得关注，尤其是北汽、江淮上市后，一汽集团成为了唯一一个游离于资本市场之外的国有大汽车集团，外在压力不容忽视。
              
              另外，与一汽集团及其下属公司关联紧密的上市公司，后续表现也不可忽略，其中，印纪传媒(21.39, 0.16, 0.75%)就颇值得关注。
              
              根据公开资料显示，印纪传媒主要业务是为客户提供品牌管理、广告创制、品牌推广等服务，根据印纪传媒公告显示，自2011年至2014年上半年，印纪传媒的销售客户中，一汽集团以及旗下的多家公司，一直都是印纪传媒的前五大客户。
              
              近日，印纪传媒2014年业绩快报就显示，2014年度，公司实现营业收入248961.19万元，较上年同期增长52.60%；实现营业利润57771.70万元，较上年同期增长81.23%；实现利润总额62931.16万元，较上年同期增长70.79%；归属于上市公司股东的净利润43650.17万元，较上年同期增长58.15%。
              
              近四年来一直是重要客户的一汽集团，经历此次高层人事震荡后，在品牌业务方面对印纪传媒即将带来的影响不可小觑。")
preddata <- strsplit(preddata, split = "")
preddata <- sapply(preddata, function(x) list(list(x)))
pred <- Corpus(VectorSource(preddata), readerControl = list(language = "ZHCN"))
for (i in 1:length(pred)){
  pred[[i]]$content <- sub("c", "", pred[[i]]$content)
}
for (i in 1:length(pred)){
  meta(pred[[i]], tag = 'id') <- i
}
pred <- DocumentTermMatrix(pred, tf) # 这里不能用tfidf,一篇文章的话tfidf为0
pred <- MakePredDtm(pred, dtm)
predict(SVM, pred)
